views/penilaian-prodi/_form.php

    <!-- Nilai -->
    <?= $form->field($model, 'nilai')->textInput(['maxlength' => true, 'type' => 'number', 'step' => '0.01', 'placeholder' => 'Masukkan nilai penilaian']) ?>

    <!-- Dropdown untuk ID Prodi -->
    <?= $form->field($model, 'id_prodi')->dropDownList(
        ArrayHelper::map(Prodi::find()->all(), 'id_prodi', 'nama_prodi'),
        ['prompt' => '-- Pilih Program Studi --']
    ) ?>

    <!-- Dropdown untuk ID Indikator -->
    <?= $form->field($model, 'id_indikator')->dropDownList(
        ArrayHelper::map(Indikator::find()->all(), 'id_indikator', 'nama_indikator'),
        ['prompt' => '-- Pilih Indikator Penilaian --']
    ) ?>
---
SELECT * FROM `prodi`
SELECT * FROM `indikator`