views/akreditasi-prodi/_form.php

    <!-- No SK -->
    <?= $form->field($model, 'no_sk')->textInput(['maxlength' => true]) ?>

    <!-- Dropdown untuk ID Lembaga Akreditasi -->
    <?= $form->field($model, 'id_lembaga_akreditasi')->dropDownList(
        ArrayHelper::map(LembagaAkreditasi::find()->all(), 'id_lembaga_akreditasi', 'nama_lembaga'),
        ['prompt' => '-- Pilih Lembaga Akreditasi --']
    ) ?>

    <!-- Dropdown untuk ID Prodi -->
    <?= $form->field($model, 'id_prodi')->dropDownList(
        ArrayHelper::map(Prodi::find()->all(), 'id_prodi', 'nama_prodi'),
        ['prompt' => '-- Pilih Program Studi --']
    ) ?>

    <!-- Dropdown untuk ID Kategori Akreditasi -->
    <?= $form->field($model, 'id_kategori_akreditasi')->dropDownList(
        ArrayHelper::map(KategoriAkreditasi::find()->all(), 'id_kategori_akreditasi', 'deskripsi'),
        ['prompt' => '-- Pilih Kategori Akreditasi --']
    ) ?>
---
SELECT * FROM `lembaga_akreditasi`
SELECT * FROM `prodi`
SELECT * FROM `kategori_akreditasi`