controllers/AkreditasiProdiController.php

    public function actionCreate()
    {
        $model = new AkreditasiProdi();

        if ($this->request->isPost) {
            if ($model->load($this->request->post()) && $model->save()) {
---
INSERT INTO `akreditasi_prodi` (`id_akreditasi_prodi`, `tanggal_mulai`, `tanggal_akhir`, `no_sk`, `id_lembaga_akreditasi`, `id_prodi`, `id_kategori_akreditasi`) VALUES (2, '2023-01-02', '2024-02-02', 'SK002/FH/2023', 1, 1, 3)

    public function actionDelete($id_akreditasi_prodi)
    {
        $this->findModel($id_akreditasi_prodi)->delete();
---
DELETE FROM `akreditasi_prodi` WHERE `id_akreditasi_prodi`=2

    protected function findModel($id_akreditasi_prodi)
    {
        if (($model = AkreditasiProdi::findOne(['id_akreditasi_prodi' => $id_akreditasi_prodi])) !== null) {
---
SELECT * FROM `akreditasi_prodi` WHERE `id_akreditasi_prodi`='2'