controllers/PenilaianProdiController.php

INSERT INTO `penilaian_prodi` (`id_penilaian_prodi`, `tahun`, `nilai`, `id_prodi`, `id_indikator`) VALUES (2, '2024', '100', 1, 1)
---
    public function actionCreate()
    {
        $model = new PenilaianProdi();

        if ($this->request->isPost) {
            if ($model->load($this->request->post()) && $model->save()) {

DELETE FROM `penilaian_prodi` WHERE `id_penilaian_prodi`=2
---
    public function actionDelete($id_penilaian_prodi)
    {
        $this->findModel($id_penilaian_prodi)->delete();

SELECT * FROM `penilaian_prodi` WHERE `id_penilaian_prodi`='2'
---
    protected function findModel($id_penilaian_prodi)
    {
        if (($model = PenilaianProdi::findOne(['id_penilaian_prodi' => $id_penilaian_prodi])) !== null) {