controllers/ProdiController.php

    public function actionCreate()
    {
        $model = new Prodi();

        if ($this->request->isPost) {
            if ($model->load($this->request->post()) && $model->save()) {
---
INSERT INTO `prodi` (`id_prodi`, `nama_prodi`, `jenjang`, `id_fakultas`) VALUES (2, 'Teknik Informatika', 'S1', 1)

    protected function findModel($id_prodi)
    {
        if (($model = Prodi::findOne(['id_prodi' => $id_prodi])) !== null) {
---
SELECT * FROM `prodi` WHERE `id_prodi`='2'